windDrivenRainFoam/validation/cubicBuilding/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Number of rain phases
nPhases         5;

// Temperature [K]
temp            293.15;  // 20°C

// Reference horizontal rainfall intensity [mm/h]
Rh              10;

// Wind field scaling factor
Ustar           1.0;

// Turbulent dispersion model
turbulentDispersion false;

// Rain phase properties based on Best (1950) distribution
// Phase 1: Small droplets
d1              0.0005;  // 0.5 mm diameter
fv1             0.1;     // 10% volume fraction

// Phase 2: Small-medium droplets  
d2              0.001;   // 1.0 mm diameter
fv2             0.2;     // 20% volume fraction

// Phase 3: Medium droplets
d3              0.0015;  // 1.5 mm diameter
fv3             0.3;     // 30% volume fraction

// Phase 4: Medium-large droplets
d4              0.002;   // 2.0 mm diameter
fv4             0.25;    // 25% volume fraction

// Phase 5: Large droplets
d5              0.003;   // 3.0 mm diameter
fv5             0.15;    // 15% volume fraction

// ************************************************************************* //