windDrivenRainFoam/validation/cubicBuilding/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        Uref            10;
        Zref            10;
        zDir            ( 0 0 1 );
        flowDir         ( 1 0 0 );
        z0              0.03;
        d               0;
        value           uniform (10 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            noSlip;
    }
    top
    {
        type            slip;
    }
    sideY1
    {
        type            symmetryPlane;
    }
    sideY2
    {
        type            symmetryPlane;
    }
    oldInternalFaces
    {
        type            noSlip;
    }
}


// ************************************************************************* //
