windDrivenRainFoam/validation/cubicBuilding/0/rain/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
 < /dev/null |  =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            windDrivenRainInlet;
        value           uniform 0;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    ground
    {
        type            zeroGradient;
    }
    
    top
    {
        type            zeroGradient;
    }
    
    sideY1
    {
        type            symmetryPlane;
    }
    
    sideY2
    {
        type            symmetryPlane;
    }
    
    oldInternalFaces
    {
        type            catchRatio;
        value           uniform 0;
    }
}

// ************************************************************************* //
