windDrivenRainFoam/validation/cubicBuilding/Allrun
#!/bin/bash
#------------------------------------------------------------------------------
# =========                 |
# \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
#  \\    /   O peration     | Version:  v2412
#   \\  /    A nd           | Website:  www.openfoam.org
#    \\/     M anipulation  |
#------------------------------------------------------------------------------
# Script to run wind-driven rain validation case
#------------------------------------------------------------------------------

# Source OpenFOAM environment
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Run wind flow simulation
echo "Running steady-state wind flow simulation..."
./runWindFlow

# Run wind-driven rain simulation
echo "Running wind-driven rain simulation..."
runApplication windDrivenRainFoam

# Extract results
echo "Extracting catch ratio data..."
python3 extractCatchRatio.py

#------------------------------------------------------------------------------